export const LOGIN_PAGE_MESSAGE = {
  loginTitle: '로그인',
  loginBody: `입력없이 간편하게 로그인하고, \n참가권을 구매해 보세요`,
};

export const SESSION_SCHEDULE_MESSAGES = {
  title: '전체 세션',
  titleBody: `컨퍼런스 참가권 구매 시 모든 세션 신청이 가능합니다.\n같은 시간대 세션은 중복 신청이 불가하오니 이점 확인해 주시길 바랍니다.`,
  buttonText: `컨퍼런스 참가권 구매`,
  buttonModalText: `세션 신청`,
};

export const SESSION_APPLY_MESSAGES = {
  title: '공간을 넘어, 연결되는 새로운 컨퍼런스 경험',
  radioBody: '*원하시는 온/오프라인을 클릭해 주세요',
  accordionTitle: '관심 있는 IT 세션',
};

export const ACCESS_MESSAGES = {
  login: '로그인 후 이용할 수 있습니다.',
  ticket: '컨퍼런스 참가권이 필요합니다.',
};

export const SESSION_TERMS = {
  terms: `개인정보취급방침
사무국은 고객님의 개인정보를 중요시하며 "정보통신망 이용촉진 및 정보보호"에 관한 법률을 준수하고 있습니다. 사무국은 개인정보취급방침을 통하여 고객님께서 제공하시는 개인정보가 어떠한 용도와 방식으로 이용되고 있으며 개인정보보호를 위해 어떠한 조치가 취해지고 있는지 알려드립니다. 사무국은 개인정보 보호법 제15조에 근거하여 아래와 같이 귀하의 개인정보를 “수집ㆍ이용ㆍ활용”에 대한 동의를 얻고자 합니다.

1. 수집하는 개인정보의 항목 및 수집 방법 
사무국은 다음과 같은 방법으로 개인정보를 수집하고 있습니다.
·수집 항목: 성명, 전화번호, 휴대폰번호, 이메일, 접속 IP정보, 결제기록, 설문조사
·개인정보 수집 방법: 홈페이지, 전화, 고객센터문의(유선/이메일), 사전/현장등록, 제휴 서비스, 모바일 어플리케이션, 기타

2. 개인정보의 수집·이용목적
사무국은 수집한 개인정보를 다음의 목적을 위해 활용합니다.
전시회 및 컨퍼런스와 관련된 참가/관람/이벤트/서비스 안내 등을 위함
사무국(주관사)에서 개최하는 유사 행사 안내 전시회 현장에서는 스케치 사진 및 영상이 촬영되며, 이는 전시회 홍보/마케팅 자료로 활용될 수 있습니다. 마케팅 활용에 대하여 이용자는 사무국에 사전/사후 언제라도 활용 철회를 요구할 수 있습니다.

3. 개인정보 취급위탁을 위한 제3자 제공관리
사무국에서는 보다 나은 서비스 제공, 고객편의 제공 등 원활한 업무 수행을 위하여 개인정보 취급 업무를 외부 전문업체(전시회 등록시스템)에 위탁하여 운영하고 있습니다. 
사무국은 전시회 등록시스템 운영계약서 등을 통하여 개인정보보호 관련 법규의 준수, 개인정보보호에 관한 비밀유지, 제3자 정보 제공에 대한 금지, 사고 시의 책임부담, 위탁기간, 처리 종료 후의 개인정보의 반환 또는 파기 의무 등을 규정하고, 이를 준수하도록
관리하고 있습니다. 수집된 데이터는 객관적인 전시회 검증을 위해 한국전시산업진흥회(AKEI)에 제공될 수 있으며, 제공된 데이터는 전시회 검증 외 다른 목적으로 절대 사용되지 않음을 알려 드립니다.

4. 전자명함시스템에 의한 개인정보 제3자 제공 동의 
본 전시회는 참관객과 참가업체 상호간의 유용한 정보교류 서비스 제공을 위한 전자명함시스템을 운용합니다.
※ 전시장 내에서 참가업체 부스 방문 시 출입증에 표기된 바코드를 스캔(사용)하는 경우, 이는 상호간에 명함교환 행위와 동일한 것으로 간주하여 해당 참가업체에게 고객님의 개인정보가 자동으로 전달됩니다. 

제공받는 자: 전자명함(고객관리) 시스템 사용
참가업체 제공목적: 비즈니스 & 마케팅 활용 
제공항목: 성명, 전화번호, 휴대폰번호, 
이메일 보유기간: 6개월 
제공여부: 출입증 바코드 스캔

5. 개인정보의 보유 및 이용기간 
원칙적으로, 개인정보 수집 및 이용목적이 달성된 후에는 해당 정보를 지체 없이 파기합니다. 단, 다음의 정보에 대해서는 아래의 이유로 명시한 기간 동안 보존합니다. 

보존 항목: 성명, 전화번호, 휴대폰번호, 이메일 
보존 근거: 관련 서비스 개선, 조사, 기획을 위함, 주관사 개최 유사행사 안내 
보존 기간: 6개월

6. 권리
원칙적으로 개인정보 보호법에 의해 개인정보 수집 동의를 거부할 권리가 있습니다. 다만, 동의하지 않으실 경우 무료참관 신청으로 인한 전시회 무료입장은 하실 수 없음을 양지하여 주시기 바랍니다. 
동의한 개인정보는 언제든지 열람, 정정, 삭제를 요구할 수 있습니다. 열람, 정정, 삭제 및 정보 제공 동의 철회는 사무국을 통해 본인 확인 후 요청할 수 있습니다. 이미 제공된 회원정보를 철회하기 위해 일정 기간 소요되며, 이 기간 동안 마케팅에 활용될 수 있음을 안내 드립니다. 소중한 정보를 보호하기 위해 신속하게 처리되도록 노력을 다하겠습니다.

※ 주관사: 한국무역협회, 한국경제신문, 전자신문, 코엑스, 케이훼어스, 한국정보통신진흥협회`,
};
