export const InsightDetailed = {
  id: 1,
  title: 'AI 에이전트 혁명: 산업을 재편하는 지능형 시스템',
  description: '간략한 세션 정보에 대해서 작성해 주세요.',
  keywords: ['업무효율도', '업무효율도', '업무효율도'],
  content: `해당 내용은 인사이트 노트를 작성한 케이스에서 보여지는 글입니다. 글쓴이가
      작성한 부분들은 숨김처리 없이 스크롤을 해서 다 보여줘야 합니다! 여기서
      자세하게 보는 게시물입니다! 모든 글들은 보여주세요 해당 내용은 인사이트
      노트를 작성한 케이스에서 보여지는 글입니다. 글쓴이가 작성한 부분들은
      숨김처리 없이 스크롤을 해서 다 보여줘야 합니다! 여기서 자세하게 보는
      게시물입니다! 모든 글들은 보여주세요해당 내용은 인사이트 노트를 작성한
      케이스에서 보여지는 글입니다. 글쓴이가 작성한 부분들은 숨김처리 없이
      스크롤을 해서 다 보여줘야 합니다! 여기서 자세하게 보는 게시물입니다! 모든
      글들은 보여주세요해당 내용은 인사이트 노트를 작성한 케이스에서 보여지는
      글입니다. 글쓴이가 작성한 부분들은 숨김처리 없이 스크롤을 해서 다 보여줘야
      합니다! 여기서 자세하게 보는 게시물입니다! 모든 글들은 보여주세요해당
      내용은 인사이트 노트를 작성한 케이스에서 보여지는 글입니다. 해당 내용은
      인사이트 노트를 작성한 케이스에서 보여지는 글입니다. 글쓴이가 작성한
      부분들은 숨김처리 없이 스크롤을 해서 다 보여줘야 합니다! 여기서 자세하게
      보는 게시물입니다! 모든 글들은 보여주세요 해당 내용은 인사이트 노트를
      작성한 케이스에서 보여지는 글입니다. 글쓴이가 작성한 부분들은 숨김처리
      없이 스크롤을 해서 다 보여줘야 합니다! 여기서 자세하게 보는 게시물입니다!
      모든 글들은 보여주세요해당 내용은 인사이트 노트를 작성한 케이스에서
      보여지는 글입니다. 글쓴이가 작성한 부분들은 숨김처리 없이 스크롤을 해서 다
      보여줘야 합니다! 여기서 자세하게 보는 게시물입니다! 모든 글들은
      보여주세요해당 내용은 인사이트 노트를 작성한 케이스에서 보여지는 글입니다.
      글쓴이가 작성한 부분들은 숨김처리 없이 스크롤을 해서 다 보여줘야 합니다!
      여기서 자세하게 보는 게시물입니다! 모든 글들은 보여주세요해당 내용은
      인사이트 노트를 작성한 케이스에서 보여지는 글입니다. 해당 내용은 인사이트
      노트를 작성한 케이스에서 보여지는 글입니다. 글쓴이가 작성한 부분들은
      숨김처리 없이 스크롤을 해서 다 보여줘야 합니다! 여기서 자세하게 보는
      게시물입니다! 모든 글들은 보여주세요 해당 내용은 인사이트 노트를 작성한
      케이스에서 보여지는 글입니다. 글쓴이가 작성한 부분들은 숨김처리 없이
      스크롤을 해서 다 보여줘야 합니다! 여기서 자세하게 보는 게시물입니다! 모든
      글들은 보여주세요해당 내용은 인사이트 노트를 작성한 케이스에서 보여지는
      글입니다. 글쓴이가 작성한 부분들은 숨김처리 없이 스크롤을 해서 다 보여줘야
      합니다! 여기서 자세하게 보는 게시물입니다! 모든 글들은 보여주세요해당
      내용은 인사이트 노트를 작성한 케이스에서 보여지는 글입니다. 글쓴이가
      작성한 부분들은 숨김처리 없이 스크롤을 해서 다 보여줘야 합니다! 여기서
      자세하게 보는 게시물입니다! 모든 글들은 보여주세요해당 내용은 인사이트
      노트를 작성한 케이스에서 보여지는 글입니다. 글과 타임라인은 동시에 작성이
      가능합니다. 하지만 이미지와 투표는 동시에 보여질 수 없습니다. 모든 글들은
      보여주세요해당 내용은 인사이트 노트를 작성한 케이스에서 보여지는 글입니다.
      해당 내용은 인사이트 노트를 작성한 케이스에서 보여지는 글입니다. 글쓴이가
      작성한 부분들은 숨김처리 없이 스크롤을 해서 다 보여줘야 합니다! 여기서
      자세하게 보는 게시물입니다! 모든 글들은 보여주세요 해당 내용은 인사이트
      노트를 작성한 케이스에서 보여지는 글입니다. 글쓴이가 작성한 부분들은
      숨김처리 없이 스크롤을 해서 다 보여줘야 합니다! 여기서 자세하게 보는
      게시물입니다! 모든 글들은 보여주세요해당 내용은 인사이트 노트를 작성한
      케이스에서 보여지는 글입니다. 글쓴이가 작성한 부분들은 숨김처리 없이
      스크롤을 해서 다 보여줘야 합니다! 여기서 자세하게 보는 게시물입니다! 모든
      글들은 보여주세요해당 내용은 인사이트 노트를 작성한 케이스에서 보여지는
      글입니다. 글쓴이가 작성한 부분들은 숨김처리 없이 스크롤을 해서 다 보여줘야
      합니다! 여기서 자세하게 보는 게시물입니다! 모든 글들은 보여주세요해당
        내용은 인사이트 노트를 작성한 케이스에서 보여지는 글입니다.`,
  profile: {
    name: 'Name',
    email: 'Sample@sample.com',
    keywords: ['직군', '직업', '관심분야', '관심분야', '관심분야', '관심분야'],
    social: {
      linkedin: 'https://linkedin.com/in/sample',
      github: 'https://github.com/sample',
      instagram: 'https://instagram.com/sample',
      notion: 'https://www.notion.so/sample',
      threads: 'https://www.threads.net/@sample',
    },
  },
};
