import { NoteListProps } from '@/types/insight/Note';

export const notes: NoteListProps[] = [
  {
    id: 1,
    sessionId: 1,
    memo: '1. AI 에이전트의 개념과 변화 페드로 도밍고스 교수는 AI 에이전트가 단순한 자동화 시스템이 아니라, 인간과 협력하며 스스로 학습하고 진화하는 지능형 시스템이라는 점을 강조했다. 과거 AI는 단순한 도구였지만, 이제는 주어진 환경을 이해하고 적응하는 방식으로 발전하고 있으며, 향후 10년 내 AI 에이전트는 거의 모든 산업에서 핵심적인 역할을 하게 될 것이라고 전망했다. 1. AI 에이전트의 개념과 변화 페드로 도밍고스 교수는 AI 에이전트가 단순한 자동화 시스템이 아니라, 인간과 협력하며 스스로 학습하고 진화하는 지능형 시스템이라는 점을 강조했다. 과거 AI는 단순한 도구였지만, 이제는 주어진 환경을 이해하고 적응하는 방식으로 발전하고 있으며, 향후 10년 내 AI 에이전트는 거의 모든 산업에서 핵심적인 역할을 하게 될 것이라고 전망했다. 1. AI 에이전트의 개념과 변화 페드로 도밍고스 교수는 AI 에이전트가 단순한 자동화 시스템이 아니라, 인간과 협력하며 스스로 학습하고 진화하는 지능형 시스템이라는 점을 강조했다. 과거 AI는 단순한 도구였지만, 이제는 주어진 환경을 이해하고 적응하는 방식으로 발전하고 있으며, 향후 10년 내 AI 에이전트는 거의 모든 산업에서 핵심적인 역할을 하게 될 것이라고 전망했다. 1. AI 에이전트의 개념과 변화 페드로 도밍고스 교수는 AI 에이전트가 단순한 자동화 시스템이 아니라, 인간과 협력하며 스스로 학습하고 진화하는 지능형 시스템이라는 점을 강조했다. 과거 AI는 단순한 도구였지만, 이제는 주어진 환경을 이해하고 적응하는 방식으로 발전하고 있으며, 향후 10년 내 AI 에이전트는 거의 모든 산업에서 핵심적인 역할을 하게 될 것이라고 전망했다.',
    isPublic: true,
    name: '김인사이트',
    time: '3시간 전',
    edited: true,
    role: '참가자',
    likeCount: 3,
    createdAt: '2025-04-04T01:00:00',
    updatedAt: '2025-04-04T01:00:00',
  },
  {
    id: 2,
    sessionId: 2,
    memo: 'AI 에이전트가 단순한 자동화를 넘어서 인간과의 협력자로 자리 잡는 과정이 인상적이었다. 특히 자연어 처리 기술과 멀티모달 AI가 결합하여 더욱 정교한 상호작용이 가능해졌다는 점이 눈에 띄었다. AI가 비즈니스에서 단순한 보조 역할이 아니라 능동적인 의사결정 지원 도구로 발전하고 있다는 점이 흥미로웠다. 강연을 통해 AI가 앞으로 어떤 방식으로 기업 운영에 혁신을 가져올 수 있을지 고민해볼 기회가 되었다. 다른 분들의 의견이 궁금하다. AI가 의사 결정 지원에 도움이 되는가?',
    isPublic: true,
    name: '이데이터',
    time: '2일 전',
    edited: false,
    role: '참가자',
    likeCount: 4,
    createdAt: '2025-04-04T01:00:00',
    updatedAt: '2025-04-04T01:00:00',
  },
];
